{

  //
  // User Interfaces
  //

  /* Fix Multi-Target cancelling so that you can cancel target by target without leaving MT mode.  Default true.
   * You can still quickly switch out of Multi-Target by pressing another action. */

  "FixMultiTargetBackout": true,

  /* Fix the bug that once you attacked an headshot immune enemy, all mechs will be immune from headshots from the same direction until you load game. */

  "FixGreyHeadDisease": true,

  /* Fix the bug that rear paper doll is incorrectly showing front structure.  Default true. */

  "FixPaperDollRearStructure": true,

  /* Show structural damage through armour.  i.e. When an armoured location is damaged, it will be displayed in a stripped pattern.  Default true. */

  "ShowUnderArmourDamage": true,

  /* Show tonnage in selection panel (bottom left) and target panel (top).  Mech class will be shortened.  Default false because it's too dense. */

  "ShowUnitTonnage": true,

  /* Show heat and stability number in selection panel (bottom left) and target panel (top).  Default true. */

  "ShowHeatAndStab": true,

  /* Fix the issue that walk / sprint does not project line of sight / fire at same height and may leads to different results. */

  "FixLosPreviewHeight": true,

  /* Show ammo count in the list of components when you mouseover the paper doll.  Default true for friends. */

  "ShowAmmoInTooltip": true,
  "ShowEnemyAmmoInTooltip": false,

  /* Set armour colour of floating bar of Player / Enemy / Ally.  Default "cyan" for player, "teal" for ally.  Set to empty to not change. */

  "FloatingArmorColourPlayer": "cyan",
  "FloatingArmorColourEnemy": "",
  "FloatingArmorColourAlly": "teal",

  //
  // Line of Sight
  //

  /* Make lines wider or thinner.  Default 2 and 1.5 times of game default.  Set to 0 to not mess with it. */

  "LOSWidth": 2.0,
  "LOSWidthBlocked": 1.5,

  /* Make obstruction marker bigger or smaller by multiplying its height and width.  Default 1.5.
   * Set to 1 to use game default, or 0 to hide the marker. */

  "LOSMarkerBlockedMultiplier": 1.5,

  /* Controls whether indirect attack lines / can't attack lines are dotted.  Default both true. */

  "LOSIndirectDotted": true,
  "LOSNoAttackDotted": true,

  /* Controls whether other attack lines are dotted.  Default all false. */

  "LOSMeleeDotted": false,
  "LOSClearDotted": false,
  "LOSBlockedPreDotted": false,
  "LOSBlockedPostDotted": false,

  /* Change fire line colour (html syntax). "#FF0000" is red, "#00FF00" is green etc.  Set to empty to leave alone.
   * The colour orders are Front, Left, Right, Back, Prone.  Set to empty string to use game default. */

  "LOSMeleeColors": "#F00,#0FF,#0FF,#0F8,#F00",
  "LOSClearColors": "#F00,#0FF,#0FF,#0F8,#F00",
  "LOSBlockedPreColors": "#D0F,#D0F,#D0F,#D0F,#D0F",
  "LOSBlockedPostColors": "#C8E,#C8E,#C8E,#C8E,#C8E",
  "LOSIndirectColors": "#F00,#0FF,#0FF,#0F8,#F00",
  "LOSNoAttackColors": "",

  /* Number of points of indirect attack lines and jump lines.  Game uses 18.  Default 48 for a smoother curve. */

  "ArcLinePoints": 48,

  /* Change marker colour of the facing indicator. Colorus are for Front, Left, Right, Back, Prone. */

  "FacingMarkerPlayerColors": "#FFFF,#CFCF,#CFCF,#AFAF,#FF8F",
  "FacingMarkerEnemyColors": "#FFFF,#FCCF,#FCCF,#FAAF,#FF8F",
  "FacingMarkerTargetColors": "#F41F,#F41F,#F41F,#F41F,#F41F",

  //
  // Called Shots
  //

  /* Did you know you can called shot the head of headshot immune boss?
   * You can do that before any headshot immune unit has been attacked.  But it won't have any effect.  Default true. */

  "FixBossHeadCalledShotDisplay": true,

  /* Enable clustering effect for called shots against mechs.  Default true. */

  "CalledShotUseClustering": true,

  /* Increase or decrease called shot multiplier against mech.  0 to disable called shot, 1 is original strength.
   * Default is 0.33 to counter the effect of CalledShotClusterStrength. */

  "MechCalledShotMultiplier": 0.33,

  /* Increase or decrease called shot multiplier against mech.  0 to disable called shot, 1 is original strength.
   * Default is 0.75 to balance vehicle's lower number of locations. */

  "VehicleCalledShotMultiplier": 0.75,

  /* Override called shot percentage display of mech locations to show modded shot distribution. Default true. */

  "ShowRealMechCalledShotChance": true,

  /* Override called shot percentage display of vehicle locations to show modded shot distribution. Default true. */

  "ShowRealVehicleCalledShotChance": true,

  /* Format of called shot location percentages, in C# String.Format syntax.
   * Use "{0:0.0}%" to *always* show one decimal, or "{0:0.#}%" for *up to* one decimal. Default is "" to leave alone. */

  "CalledChanceFormat": "",

  //
  // Individual To Hit Modifiers
  //

  /* Modify base weapon hit chance.  -0.05 to make all base accuracy -5%, 0.1 to make them +10% etc.  Default 0. */

  "BaseHitChanceModifier": 0.0,

  /* Modify base melee hit chance.  -0.05 to make all melee and DFA accuracy -5%, 0.1 to make them +10% etc.  Default 0. */

  "MeleeHitChanceModifier": 0.0,

  /* Allow attacks from low ground to high ground to incur accuracy penalty.  Default true. */

  "AllowLowElevationPenalty": true,

  /* Directional to hit modifiers.  Effective only if "Direction" is in the modifier factor list(s).  Default front 0, side -1, back -2. */

  "ToHitMechFromFront": 0,
  "ToHitMechFromSide": -1,
  "ToHitMechFromRear": -2,
  "ToHitVehicleFromFront": 0,
  "ToHitVehicleFromSide": -1,
  "ToHitVehicleFromRear": -2,

  /* Hit modifier after jumping, added on top of movement modifier (if any).  Effective only if "Jumped" is in the modifier factor list(s).  Default 0. */

  "ToHitSelfJumped": 2,

  //
  // Net To Hit Modifiers
  //

  /* Allow bonus total modifier to increase hit chance.  Default true. */

  "AllowNetBonusModifier": true,

  /* Step of hit chance.  Game default is 0.05, or 5%.  Hit chance is always rounded down.
   * Default 0 to remove hit chance step, so that odd gunnery stats can enjoy their +2.5% hit chance. */

  "HitChanceStep": 0.0,

  /* Max and min hit chance after all modifiers but before roll correction. Default 0.95 and 0.05, same as game default.
   * Note that 100% hit chance (max) may still miss if roll correction is enabled. */

  "MaxFinalHitChance": 1.0,
  "MinFinalHitChance": 0.0,

  /* Make hit chance modifier has diminishing return rather than simple add and subtract.  Default false. */

  "DiminishingHitChanceModifier": true,

  /* Diminishing Bonus: 2-Base^(Bonus/Divisor).  Default 2-0.8^(Bonus/6) and caps at +16.
   * Example: +3 Bonus @ 80% Base ToHit == 1.1 x 0.8 == 88% Hit */

  "DiminishingBonusPowerBase": 0.8,
  "DiminishingBonusPowerDivisor": 6.0,
  "DiminishingBonusMax": 16,

  /* Diminishing Penalty: Base^(Penalty/Divisor).  Default 0.8^(Penalty/3.3) and caps at +32.
   * Example: +6 Penalty @ 80% Base ToHit == 67% x 0.8 == 53% Hit */

  "DiminishingPenaltyPowerBase": 0.8,
  "DiminishingPenaltyPowerDivisor": 3.3,
  "DiminishingPenaltyMax": 32,

  /* Specify set of hit modifiers of ranged attacks. Leave empty to keep it unchanged.  Order and letter case does not matter.
   * Default "ArmMounted, Direction, Height, Indirect, Inspired, Jumped, LocationDamage, Obstruction, Precision, Range, Refire, SelfHeat, SelfStoodUp, SelfTerrain, SensorImpaired, SensorLock, Sprint, TargetEffect, TargetEvasion, TargetProne, TargetShutdown, TargetSize, TargetTerrain, Walked, WeaponAccuracy, WeaponDamage".
   * You can remove some options or replace SelfTerrain and TargetTerrain with SelfTerrainMelee and TargetTerrainMelee. */

  "RangedAccuracyFactors": "ArmMounted, Direction, Height, Indirect, Inspired, Jumped, LocationDamage, Obstruction, Precision, Range, Refire, SelfHeat, SelfStoodUp, SelfTerrain, SensorImpaired, SensorLock, Sprint, TargetEffect, TargetEvasion, TargetProne, TargetShutdown, TargetSize, TargetTerrain, Walked, WeaponAccuracy, WeaponDamage",

  /* Specify set of hit modifiers of melee and DFA attacks. Leave empty to keep it unchanged.  Order and letter case does not matter.
   * Default "DFA, Direction, Height, Inspired, Jumped, SelfChassis, SelfHeat, SelfStoodUp, SelfTerrainMelee, Sprint, TargetEffect, TargetEvasion, TargetProne, TargetShutdown, TargetSize, TargetTerrainMelee, Walked, WeaponAccuracy".
   * Other options are ArmMounted, Obstruction, Refire, SelfTerrain, SensorImpaired, TargetTerrain. */

  "MeleeAccuracyFactors": "ArmMounted, DFA, Direction, Height, Inspired, Jumped, SelfChassis, SelfHeat, SelfStoodUp, SelfTerrainMelee, SensorImpaired, Sprint, TargetEffect, TargetEvasion, TargetProne, TargetShutdown, TargetSize, TargetTerrainMelee, Walked, WeaponAccuracy",

  //
  // To Hit Rolls
  //

  /* Increase or decrease roll correction strength.  0 to disable roll correction, 1 is original strength, max is 2 for double strength.
   * Default is 0.5 for less correction. */

  "RollCorrectionStrength": 0.0,

  /* Set miss streak breaker threshold.  Only attacks with hit rate above the threshold will add to streak breaker.
   * Default is 0.5, same as game default.  Set to 1 to disable miss streak breaker. */

  "MissStreakBreakerThreshold": 1.0,

  /* Set miss streak breaker divider.  Set to negative integer or zero to make it a constant bonus, e.g. -5 = 5% bonus per miss.
   * Otherwise, MissStreakBreakerThreshold is deduced from triggering attack's hit rate, then divided by this much, then added to streak breaker's chance modifier.
   * Default is 5, same as game default. */

  "MissStreakBreakerDivider": 5.0,

  //
  // Modifiers Preview
  //

  /* Display base hit chance in weapon mouseover hint.  Default true. */

  "ShowBaseHitchance": true,

  /* Apply self moved modifier during preview, before the move actually take place.  Default true. */

  "FixSelfSpeedModifierPreview": true,

  /* Show corrected hit chance in weapon panel, instead of original (fake) hit chance, before streak breaker.  Default false. */

  "ShowCorrectedHitChance": false,

  /* Format of called shot location percentages, in C# String.Format syntax.
   * Game default is "{0:0}%". Use "{0:0.0}%" to *always* show one decimal, or "{0:0.#}%" for *up to* one decimal.
   * Default is "", which will use "{0:0.#}%" if HitChanceStep is 0 and DiminishingHitChanceModifier is false, otherwise leave alone. */

  "HitChanceFormat": "{0:0.0}%",

  //
  // Melee and DFA
  //

  /* Allow all possible melee / DFA attack positions. */

  "IncreaseMeleePositionChoice": true,
  "IncreaseDFAPositionChoice": true,

  /* Break the restriction that one must stay still to melee adjacent mech. */

  "UnlockMeleePositioning": true,

  //
  // Hit Resolution
  //

  /* Skip critical checks if target is dead.  Default true. */

  "SkipCritingDeadMech": false,

  /* Yang has improved autoloader's algorithm to balance ammo draw to minimise ammo explosion chance.  Default true for friends. */

  "BalanceAmmoConsumption": true,
  "BalanceEnemyAmmoConsumption": true,

  /* When an ammo is useless, such as because the weapon is destroyed, eject the ammo at end of turn if not prone.  Default true for friends. */

  "AutoJettisonAmmo": true,
  "AutoJettisonEnemyAmmo": true,

  /* Increase hit distribution precision for degrading called shots.  Default true.  Fix hit distribution bug on game ver 1.1.0 and below. */

  "FixHitDistribution": true,

  /* If a location would become a zombie part with zero hp, make sure it is destroyed instead. Default true. */

  "KillZeroHpLocation": true,

  //
  // Logging
  //

  /* Log attack info to "Log_Attack.txt", for copy and paste to Excel to make it human readable.
   * Setting can be "None", "Attack", "Shot", "Location", "Damage", "Critical", or "All", from simplest to heaviest.  Default "None".
   * "All" is currently same as "Critical", but more levels may be added in future.  Letter case does not matter. */

  "AttackLogLevel": "All",

  /* Format of attack log.  Can be "csv", "tsv", or "txt" (same as tsv). Default "csv". */

  "AttackLogFormat": "csv",

  /* How many old attack log to keep.  Logs are archived on game launch, if attack log is enabled.Default is 4 for 4MB.  Set to 0 to not keep any old logs. */

  "AttackLogArchiveMaxMB": 4,

  /* Location of mod log and roll log.  Default is "" to put them in mod folder.  Relative path would be relative to BATTLETECH exe. */

  "LogFolder": "",

  /* Used to determine which settings should be updated and how.  Please do not change. */

  "SettingVersion": 2001000
}